#Пользователь вводит число, нужно вывести чило pi с заданной точностью(БЕЗ БИБЛИОТЕК/МОДУЛЕЙ)
t = int(input("Введите число:\t"))
pi =3+4/(2*3*4)-4/(4*5*6)+4/(8*9*10)+4/(10*11*12)-4/(12*13*14)
print(round(pi,t))