#Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
spisok = [5,10,8,6,3,10]
print(spisok)
print(sum(spisok[1::2]))